schedule.org
#+OPTIONS: toc:nil H:2 num:0 \n:t

#+BEGIN_COMMENT
org export to HTML
remove header before yaml
remove postamble
save as md file
#+END_COMMENT

#+BEGIN_EXPORT html
---
layout: page
title: Schedule
permalink: /schedule/
---
<script src="https://code.jquery.com/jquery-3.1.1.js"
        integrity="sha256-16cdPddA6VdVInumRGo6IbivbERE8p7CQR3HzTBuELA="
        crossorigin="anonymous"></script>

<script>
 $(document).ready(function(){
     $('td:contains("Pset")').closest('tr').css('background-color','LemonChiffon');
     $('td:contains("exam")').closest('tr').css('background-color','LightSalmon');
 });
</script>
#+END_EXPORT
| Lecture      | Feb. 6  | overview and simple perceptron           |   |
| Lecture      | Feb. 8  | delta rule                               |   |
| Pset 1 due   | Feb. 13 | simple perceptrons                       |   |
| Lecture      | Feb. 13 | multilayer perceptrons                   |   |
| Lecture      | Feb. 15 | backpropagation                          |   |
| Pset 2 due   | Feb. 20 | multilayer perceptrons                   |   |
| Lecture      | Feb. 20 | stochastic gradient descent              |   |
| Lecture      | Feb. 22 | generalization and regularization        |   |
| Pset 3 due   | Feb. 27 | black art of backprop                    |   |
| Lecture      | Feb. 27 | convolution and pooling                  |   |
| Lecture      | Mar. 1  | ConvNet backprop                         |   |
| Pset 4 due   | Mar. 6  | LeNet                                    |   |
| Lecture      | Mar. 6  | visual object recognition                |   |
| Lecture      | Mar. 8  | image to image transforms                |   |
| Lecture      | Mar. 13 | biological vision                        |   |
| Midterm      | Mar. 15 | in-class exam                            |   |
| Spring break |         |                                          |   |
| Lecture      | Mar. 27 | deep learning frameworks                 |   |
| Lecture      | Mar. 29 | parallel and distributed algorithms      |   |
| Pset 5 due   | Apr. 3  | ConvNets at scale                        |   |
| Lecture      | Apr. 3  | PCA and clustering                       |   |
| Lecture      | Apr. 5  | autoencoders                             |   |
| Pset 6 due   | Apr. 10 | unsupervised learning                    |   |
| Lecture      | Apr. 10 | contrastive Hebbian learning             |   |
| Lecture      | Apr. 12 | backprop through time                    |   |
| Pset 7 due   | Apr. 17 | recurrent nets                           |   |
| Lecture      | Apr. 17 | MLPs for language                        |   |
| Lecture      | Apr. 19 | RNNs for language                        |   |
| Pset 8 due   | Apr. 24 | language modeling                        |   |
| Lecture      | Apr. 24 | policy gradient                          |   |
| Lecture      | Apr. 26 | value function                           |   |
| Pset 9 due   | May 1   | reinforcement learning                   |   |
| Lecture      | May 1   | ICA and NMF                              |   |
| Lecture      | May 3   | unsupervised learning in the brain       |   |
