schedule.md
---
layout: page
title: Schedule
permalink: /schedule/
---
<script src="https://code.jquery.com/jquery-3.1.1.js"
        integrity="sha256-16cdPddA6VdVInumRGo6IbivbERE8p7CQR3HzTBuELA="
        crossorigin="anonymous"></script>

<script>
 $(document).ready(function(){
     $('td:contains("Pset")').closest('tr').css('background-color','LemonChiffon');
     $('td:contains("exam")').closest('tr').css('background-color','LightSalmon');
 });
</script>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Feb. 6</td>
<td class="org-left">overview and simple perceptron</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Feb. 8</td>
<td class="org-left">delta rule</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Pset 1 due</td>
<td class="org-left">Feb. 13</td>
<td class="org-left">simple perceptrons</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Feb. 13</td>
<td class="org-left">multilayer perceptrons</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Feb. 15</td>
<td class="org-left">backpropagation</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Pset 2 due</td>
<td class="org-left">Feb. 20</td>
<td class="org-left">multilayer perceptrons</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Feb. 20</td>
<td class="org-left">stochastic gradient descent</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Feb. 22</td>
<td class="org-left">generalization and regularization</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Pset 3 due</td>
<td class="org-left">Feb. 27</td>
<td class="org-left">black art of backprop</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Feb. 27</td>
<td class="org-left">convolution and pooling</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Mar. 1</td>
<td class="org-left">ConvNet backprop</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Pset 4 due</td>
<td class="org-left">Mar. 6</td>
<td class="org-left">LeNet</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Mar. 6</td>
<td class="org-left">visual object recognition</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Mar. 8</td>
<td class="org-left">image to image transforms</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Mar. 13</td>
<td class="org-left">biological vision</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Midterm</td>
<td class="org-left">Mar. 15</td>
<td class="org-left">in-class exam</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Spring break</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Mar. 27</td>
<td class="org-left">deep learning frameworks</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Mar. 29</td>
<td class="org-left">parallel and distributed algorithms</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Pset 5 due</td>
<td class="org-left">Apr. 3</td>
<td class="org-left">ConvNets at scale</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Apr. 3</td>
<td class="org-left">PCA and clustering</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Apr. 5</td>
<td class="org-left">autoencoders</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Pset 6 due</td>
<td class="org-left">Apr. 10</td>
<td class="org-left">unsupervised learning</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Apr. 10</td>
<td class="org-left">contrastive Hebbian learning</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Apr. 12</td>
<td class="org-left">backprop through time</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Pset 7 due</td>
<td class="org-left">Apr. 17</td>
<td class="org-left">recurrent nets</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Apr. 17</td>
<td class="org-left">MLPs for language</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Apr. 19</td>
<td class="org-left">RNNs for language</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Pset 8 due</td>
<td class="org-left">Apr. 24</td>
<td class="org-left">language modeling</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Apr. 24</td>
<td class="org-left">policy gradient</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Apr. 26</td>
<td class="org-left">value function</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Pset 9 due</td>
<td class="org-left">May 1</td>
<td class="org-left">reinforcement learning</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">May 1</td>
<td class="org-left">ICA and NMF</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">May 3</td>
<td class="org-left">unsupervised learning in the brain</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
